Revit 2026 API

# WireMaterialTypeTemperatureRatings Property

---

Get all temperature rating type definitions defined in this wire material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TemperatureRatingTypeSet TemperatureRatings { get; }
```
```vb
Public ReadOnly Property TemperatureRatings As TemperatureRatingTypeSet
	Get
```
```cpp
public:
property TemperatureRatingTypeSet^ TemperatureRatings {
	TemperatureRatingTypeSet^ get ();
}
```
```fsharp
member TemperatureRatings : TemperatureRatingTypeSet with get
```

#### Property Value

TemperatureRatingTypeSet

#### Reference

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace